In [1]:
import sqlite3
from sqlite3 import Error
import pandas as pd

In [2]:
conn = sqlite3.connect('tx_deathrow_full.db')

In [3]:
df = pd.read_csv('tx_deathrow_full.csv')
df.to_sql('tx_deathrow_full',conn,if_exists='fail')

C:\Users\19035\Anaconda3\envs\learn-env\lib\site-packages\pandas\core\generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [4]:
cur=conn.cursor()

In [5]:
data = pd.DataFrame(cur.execute("""SELECT * FROM tx_deathrow_full""").fetchall())
data.columns = [x[0] for x in cur.description]

In [6]:
data.head()

,index,Execution,Date of Birth,Date of Offence,Highest Education Level,Last Name,First Name,TDCJ\nNumber,Age at Execution,Date Received,Execution Date,Race,County,Eye Color,Weight,Height,Native County,Native State,Last Statement
0,0,553,1983-09-24,2004-11-21,9.0,Young,Christopher Anthony,999508,34,2006-03-31,2018-07-17,Black,Bexar,Brown,216.0,"6' 1""",Bexar,Texas,l want to make sure the Patel family knows I l...
1,1,552,1951-08-28,1979-05-27,12.0,Bible,Danny Paul,999455,66,2003-07-17,2018-06-27,White,Harris,Blue,194.0,"5' 7""",Brazoria,Texas,None
2,2,551,1981-04-03,2003-12-03,10.0,Castillo,Juan Edward,999502,37,2005-09-27,2018-05-16,Hispanic,Bexar,Brown,180.0,"5' 11""",Bexar,Texas,To everyone that has been there for me you kno...
3,3,550,1987-04-04,2008-04-06,11.0,Davila,Erick Daniel,999545,31,2009-02-27,2018-04-25,Black,Tarrant,Brown,161.0,"5' 11""",Tarrant,Texas,"Yes, I would like to say nephew it burns huh. ..."
4,4,549,1980-03-26,2005-09-13,12.0,Rodriguez III,Rosendo,999534,38,2008-05-14,2018-03-27,Hispanic,Lubbock,Brown,198.0,"5' 8""",Wichita,Texas,First I would like to say I have been here sin...

In [7]:
def query(query):
    """
    Executes the sql query to output as pandas DataFrame
    ---------------------------------------
    Input:
    query (str): SQL query
    ---------------------------------------
    Output:
    pandas DataFrame
    """
    try:
        data = pd.DataFrame(cur.execute(query).fetchall())
        data.columns = [x[0] for x in cur.description]
    except:
        print('Cant Return Query')
    
    return data

In [8]:
def query_error(query):
    """
    Executes the sql query to output as pandas DataFrame
    ---------------------------------------
    Input:
    query (str): SQL query
    ---------------------------------------
    Output:
    pandas DataFrame
    """
    try:
        data = pd.DataFrame(cur.execute(query).fetchall())
        data.columns = [x[0] for x in cur.description]
    except:
        print('Cant Return Query')
    
    return data

In [9]:
def sql(query):
    return cur.execute(query)

In [10]:
sql("""ALTER TABLE tx_deathrow_full RENAME TO executions""")

In [11]:
sql("""ALTER TABLE executions RENAME 'First Name' TO first_name""")

In [12]:
sql("""ALTER TABLE executions RENAME 'Last Name' TO last_name""")
sql("""ALTER TABLE executions RENAME 'Execution' TO ex_number""")
sql("""ALTER TABLE executions RENAME 'Age at Execution' TO ex_age""")
sql("""ALTER TABLE executions RENAME 'Execution Date' TO ex_date""")
sql("""ALTER TABLE executions RENAME 'Last Statement' TO last_statement""")

In [13]:
query("""SELECT * FROM executions LIMIT 5""")

,index,ex_number,Date of Birth,Date of Offence,Highest Education Level,last_name,first_name,TDCJ\nNumber,ex_age,Date Received,ex_date,Race,County,Eye Color,Weight,Height,Native County,Native State,last_statement
0,0,553,1983-09-24,2004-11-21,9.0,Young,Christopher Anthony,999508,34,2006-03-31,2018-07-17,Black,Bexar,Brown,216.0,"6' 1""",Bexar,Texas,l want to make sure the Patel family knows I l...
1,1,552,1951-08-28,1979-05-27,12.0,Bible,Danny Paul,999455,66,2003-07-17,2018-06-27,White,Harris,Blue,194.0,"5' 7""",Brazoria,Texas,None
2,2,551,1981-04-03,2003-12-03,10.0,Castillo,Juan Edward,999502,37,2005-09-27,2018-05-16,Hispanic,Bexar,Brown,180.0,"5' 11""",Bexar,Texas,To everyone that has been there for me you kno...
3,3,550,1987-04-04,2008-04-06,11.0,Davila,Erick Daniel,999545,31,2009-02-27,2018-04-25,Black,Tarrant,Brown,161.0,"5' 11""",Tarrant,Texas,"Yes, I would like to say nephew it burns huh. ..."
4,4,549,1980-03-26,2005-09-13,12.0,Rodriguez III,Rosendo,999534,38,2008-05-14,2018-03-27,Hispanic,Lubbock,Brown,198.0,"5' 8""",Wichita,Texas,First I would like to say I have been here sin...

## The Beazley Case

Coments in SQL within: `/*.......*/`

In [14]:
# Arithematic Operations:

query("""SELECT 50+2,51*2""")

   50+2  51*2
0    52   102

In [15]:
query("""SELECT 51/2""")

   51/2
0    25

This gives out a round number since SQL does an **integer** division. **For the decimal point, 51.0/2.0**

In [16]:
query("""SELECT 51.0/2.0""")

   51.0/2.0
0      25.5

In [17]:
query("""SELECT first_name,last_name,ex_age FROM executions
WHERE ex_age <= 25""")

  first_name   last_name  ex_age
0    Toronto   Patterson      24
1       T.J.       Jones      25
2   Napoleon     Beazley      25
3    Richard     Andrade      25
4        Jay   Pinkerton      24
5      Jesse  De La Rosa      24

> The most powerful of these is probably `LIKE`. It allows us to use wildcards such as `%` and `_` to match various characters. For instance, `first_name LIKE '%roy'` will return true for rows with first names ‘roy’, ‘Troy’, and ‘Deroy’ but not ‘royman’. The wildcard `_` will match a single character so `first_name LIKE '_roy'` will only match ‘Troy’.

In [18]:
# Modify the query to find the result for Raymond Landry.
#You might think this would be easy since we already know his first and last name. 
#But datasets are rarely so clean. 
#Use the LIKE operator so you don't have to know his name perfectly to find the row.

query("""SELECT first_name, last_name, ex_number
FROM executions
WHERE first_name = 'Raymond'
  AND last_name = 'Landry'""")

Cant Return Query

Empty DataFrame
Columns: []
Index: []

In [19]:
query("""SELECT first_name, last_name, ex_number
FROM executions
WHERE first_name LIKE '%Raymond%'
  AND last_name LIKE '%Landry%'""")

  first_name    last_name  ex_number
0    Raymond  Landry, Sr.         29

> Quotes
In SQL, strings are denoted by single quotes. Backticks (ie `` can be used to denote column and table names. This is useful when the column or table name is the same as a SQL keyword and when they have a space in them. It's possible to have a database with a table named 'where' and a column named 'from'. (Who would be so cruel as to do this?!) You would have to do `SELECT ``from`` FROM ``where`` WHERE` .... This is another example why capitalization of SQL commands helps.

>As you’ve seen in the previous exercise, complex clauses can be made out of simple ones using Boolean operators like `NOT`, `AND` and `OR`. SQL gives most **precedence to NOT and then AND and finally OR**. But if, like me, you’re too lazy to remember the order of precedence, you can use parenthesis to clarify the order you want.

Quiz:

Correct answers:

`WHERE 0`

1 and 0 are the most basic Boolean statements. This block guarantees that no rows will be returned.

`WHERE ex_number < ex_age`

Multiple column names may be used in a clause.

`WHERE ex_age`

SQL can evaluate the truth-value of almost anything. The 'ex_age' column is filled with integers. The rule for integers is 0 is false and everything else is true, so only rows with non-zero ages will be returned.

In [20]:
# Napolean Beazley's last statement:

query("""SELECT last_statement FROM executions
WHERE first_name LIKE '%Napoleon%'
AND last_name LIKE '%Beazley%'""")

                                      last_statement
0  The act I committed to put me here was not jus...

In [21]:
beazly_statement = query("""SELECT last_statement FROM executions
WHERE first_name LIKE '%Napoleon%'
AND last_name LIKE '%Beazley%'""")

print(beazly_statement['last_statement'][0])

The act I committed to put me here was not just heinous, it was senseless. But the person that committed that act is no longer here - I am. I'm not going to struggle physically against any restraints. I'm not going to shout, use profanity or make idle threats. Understand though that I'm not only upset, but I'm saddened by what is happening here tonight. I'm not only saddened, but disappointed that a system that is supposed to protect and uphold what is just and right can be so much like me when I made the same shameful mistake. If someone tried to dispose of everyone here for participating in this killing, I'd scream a resounding, "No." I'd tell them to give them all the gift that they would not give me...and that's to give them all a second chance. I'm sorry that I am here. I'm sorry that you're all here. I'm sorry that John Luttig died. And I'm sorry that it was something in me that caused all of this to happen to begin with. Tonight we tell the world that there are no second chances in the eyes of justice...Tonight, we tell our children that in some instances, in some cases, killing is right. This conflict hurts us all, there are no SIDES. The people who support this proceeding think this is justice. The people that think that I should live think that is justice. As difficult as it may seem, this is a clash of ideals, with both parties committed to what they feel is right. But who's wrong if in the end we're all victims? In my heart, I have to believe that there is a peaceful compromise to our ideals. I don't mind if there are none for me, as long as there are for those who are yet to come. There are a lot of men like me on death row - good men - who fell to the same misguided emotions, but may not have recovered as I have. Give those men a chance to do what's right. Give them a chance to undo their wrongs. A lot of them want to fix the mess they started, but don't know how. The problem is not in that people aren't willing to help them find out, but in the system telling them it won't matter anyway. No one wins tonight. No one gets closure. No one walks away victorious.

## Claims of Innocence

In [22]:
query("""SELECT COUNT(first_name) FROM executions""")

   COUNT(first_name)
0                553

As you can tell, the COUNT function is intrinsically tied to the concept of NULLs.

In [23]:
#Find the total number of executions in the dataset.
#The idea here is to pick one of the columns that you're confident has no NULLs and count it.

query("""SELECT COUNT(ex_number) FROM executions""")

   COUNT(ex_number)
0               553

So far so good. But what if we don’t know which columns are NULL-free? Worse still, what if none of the columns are NULL-free? Surely there must still be a way to find the length of the table!

The solution is COUNT(*). This is reminiscent of SELECT * where the * represents all columns. In practice COUNT(*) counts rows as long as any one of their columns is non-null. This helps us find table lengths because a table shouldn’t have rows that are completely null.

In [24]:
query("""SELECT COUNT(*) FROM executions""")

   COUNT(*)
0       553

In [25]:
query("""SELECT
    SUM(CASE 
            WHEN county='Harris' THEN 1
            ELSE 0 
        END) AS execution_harris,
    SUM(CASE 
            WHEN county='Bexar' THEN 1
            ELSE 0 
        END) AS execution_bexar
FROM executions""")

   execution_harris  execution_bexar
0               128               46

In [26]:
query("""SELECT COUNT(ex_age) FROM executions WHERE ex_age > 50""")

   COUNT(ex_age)
0             68

In [27]:
query("""SELECT COUNT(*) FROM executions WHERE last_statement IS NULL""")

#OR
#SELECT COUNT(CASE WHEN last_statement IS NULL THEN 1 ELSE NULL END) FROM executions
#OR
#SELECT COUNT(*) - COUNT(last_statement) FROM executions

   COUNT(*)
0       110

It is worthwhile to step back and think about the different ways the computer handled these three queries. The WHERE version had it filter down to a small table first before aggregating while in the other two, it had to look through the full table. In the COUNT + CASE WHEN version, it only had to go through once, while the double COUNT version made it go through twice. So even though the output was identical, the performance was probably best in the first and worst in the third version.

In [29]:
query("""SELECT MIN(ex_age), MAX(ex_age), AVG(ex_age) FROM executions""")

   MIN(ex_age)  MAX(ex_age)  AVG(ex_age)
0           24           67    39.470163

In [31]:
#Find the average length (based on character count) of last statements in the dataset.
query("""SELECT AVG(LENGTH(last_statement)) FROM executions""")

   AVG(LENGTH(last_statement))
0                   537.492099

Sometimes, LEN() than LENGTH

>https://sqlite.org/index.html

>For lookups, I often use W3 Schools, Stack Overflow and the official SQLite documentation.

In [32]:
#List all the counties in the dataset without duplication.
#We can get unique entries by using SELECT DISTINCT. 

query("""SELECT DISTINCT(county) FROM executions""")

      County
0      Bexar
1     Harris
2    Tarrant
3    Lubbock
4     Dallas
..       ...
87   Kleberg
88  Hamilton
89     Milam
90  Chambers
91    Hardin

[92 rows x 1 columns]

In [34]:
#Find the proportion of inmates with claims of innocence in their last statements.
#To do decimal division, ensure that one of the numbers is a decimal by multiplying it by 1.0. 
#Use LIKE '%innocent%' to find claims of innocence.

query("""SELECT 1.0 * COUNT(CASE WHEN last_statement LIKE '%innocent%'
    THEN 1 ELSE NULL END) / COUNT(*)  AS fraction_innocent
FROM executions""")

   fraction_innocent
0           0.056058

In [36]:
query("""SELECT (SELECT COUNT(last_statement) FROM executions 
		WHERE last_statement LIKE '%innocent%')*1.0/
		(SELECT COUNT(*) FROM executions) AS fraction_innocent""")

   fraction_innocent
0           0.056058

## The Long Tail